InformationRegisters/ИсторияСобытийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСобытийЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_БылИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ра_СталИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСобытийЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыСобытийЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавленПредмет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаВажность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаДатаВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененСрок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененыПредметы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенаИзПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОткрытаКарточка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перенаправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаКИсполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКИсполнениюОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдаленПредмет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ИсторияСобытийЗадач/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// История событий задач: содержит процедуры по регистрации событий с задачами.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записывает событие по задаче.
//
// Параметры:
//  Задача - Задача.ЗадачаИсполнителя - задача.
//  Событие - ПеречислеСсылка.ВидыСобытийЗадач - событие произошедшее с задачей.
//  Комментарий - Строка - комментарий события.
//  АвторСобытия - СправочникСсылка.Пользователи - пользователь под которым произошло событие,
//                если параметр не задан, то подставляется текущий пользователь.
//
Процедура ЗаписатьСобытие(Задача, Событие, Комментарий = "", АвторСобытия = Неопределено, ПараметрыСобытия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МенеджерЗаписи = РегистрыСведений.ИсторияСобытийЗадач.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	
	Если ЗначениеЗаполнено(АвторСобытия) Тогда
		МенеджерЗаписи.Пользователь = АвторСобытия;
	Иначе
		МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	МенеджерЗаписи.Событие = Событие;
	
	// ТСК Корнюшенков А.Ю. ОбменЛучшимиПрактиками 31.10.2018 {
	Если ПараметрыСобытия <> Неопределено
		И ПараметрыСобытия.Свойство("ра_БылИсполнитель")
		И ПараметрыСобытия.Свойство("ра_СталИсполнитель") Тогда 
		МенеджерЗаписи.ра_БылИсполнитель  = ПараметрыСобытия.ра_БылИсполнитель;
		МенеджерЗаписи.ра_СталИсполнитель = ПараметрыСобытия.ра_СталИсполнитель;
	КонецЕсли;	
	// ТСК Корнюшенков А.Ю. ОбменЛучшимиПрактиками 31.10.2018 } 
	
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Записывает событие открытие карточки задачи
//
// Параметры:
//  Задача - Задача.ЗадачаИсполнителя - задача.
//
Процедура ЗаписатьСобытиеОткрытаКарточка(Задача) Экспорт
	
	ЗаписатьСобытие(Задача, Перечисления.ВидыСобытийЗадач.ОткрытаКарточка);
	
КонецПроцедуры

#КонецОбласти
